"""
Создайте словарь, в котором ключами будут числа от 1 до 10, а значениями эти же числа, возведенные в куб.
"""
numb = {}
for i in range(1, 11):
    numb [i] = i**2
print(numb)
